export const defaultGoal = "Выбор лучшей программной платформы";

export const defaultCriteriaText = `Масштабируемость
Удобство интеграции
Кроссплатформенность
Простота получения данных`;

export const defaultAlternativesText = `Stardog
BrightstarDB
GraphDB
HypergraphQL`;

export const exampleCriteriaMatrix = [
    [1, 3, 5, 7],
    [1 / 3, 1, 3, 5],
    [1 / 5, 1 / 3, 1, 3],
    [1 / 7, 1 / 5, 1 / 3, 1],
];

export const exampleAlternativeMatrices = {
    Масштабируемость: [
        [1, 3, 5, 7],
        [1 / 3, 1, 3, 5],
        [1 / 5, 1 / 3, 1, 3],
        [1 / 7, 1 / 5, 1 / 3, 1],
    ],
    "Удобство интеграции": [
        [1, 1 / 3, 1 / 5, 3],
        [3, 1, 1 / 3, 5],
        [5, 3, 1, 7],
        [1 / 3, 1 / 5, 1 / 7, 1],
    ],
    Кроссплатформенность: [
        [1, 1 / 3, 3, 5],
        [3, 1, 5, 7],
        [1 / 3, 1 / 5, 1, 3],
        [1 / 5, 1 / 7, 1 / 3, 1],
    ],
    "Простота получения данных": [
        [1, 5, 7, 3],
        [1 / 5, 1, 3, 1 / 3],
        [1 / 7, 1 / 3, 1, 1 / 5],
        [1 / 3, 3, 5, 1],
    ],
};